src/cf/Catalogs/уатСтатьиДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатСтатьиДоходов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.уатРегламентированный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияМеждуТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособыРаспределенияДоходовРасходовМеждуТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработкиРаспределенияМеждуТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияМеждуАналитиками</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособыРаспределенияДоходовРасходовМеждуАналитиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработкиРаспределенияМеждуАналитиками</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределениеНепрямыхДоходовПоЗаказам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатРаспределениеНепрямыхДоходовРасходовПоЗаказам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределениеДоходовПоСцепкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияВнутриСцепки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСпособРаспределенияВнутриСцепки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработкиРаспределенияМеждуЗаказами</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/уатСпособыРаспределенияДоходовРасходовМеждуАналитиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатСпособыРаспределенияДоходовРасходовМеждуАналитиками</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РаспределятьПоЗаказам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределятьПоВыработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРаспределять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатСтатьиДоходов/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если (НЕ ЭтоГруппа) И СпособРаспределенияМеждуАналитиками = Перечисления.уатСпособыРаспределенияДоходовРасходовМеждуАналитиками.РаспределятьПоЗаказам
		И НЕ ПараметрВыработкиРаспределенияМеждуАналитиками.ИспользоватьДляМаршрутныхЛистов Тогда
		ТекстНСТР = НСтр("en='Specify output parameter divided between analysts that is not used while service calculating at itenerary list';ru='Указан параметр выработки распределения между аналитиками, не использующийся при расчете услуг в маршрутных листах'");
		уатОбщегоНазначенияСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстНСТР,,, "ПараметрВыработкиРаспределенияМеждуАналитиками", Отказ);
	КонецЕсли;
	
	Если Не ЭтоГруппа И РаспределениеДоходовПоСцепкам И Не ЗначениеЗаполнено(СпособРаспределенияВнутриСцепки) Тогда 
		ТекстНСТР = НСтр("en='It is necessary to specify allocation method of income within coupling.';ru='Необходимо указать способ распределения доходов внутри сцепки.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР, ЭтотОбъект, "СпособРаспределенияВнутриСцепки",, Отказ);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
